; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p10---int100n150-m25---int100c200---s164---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level1 level4 level5)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level2 level4 level6)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level3 level4 level7)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level4 level4 level8)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level5 level4 level9)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level6 level4 level10)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level7 level4 level11)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level8 level4 level12)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level9 level4 level13)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level10 level4 level14)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level11 level4 level15)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level12 level4 level16)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level13 level4 level17)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level14 level4 level18)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level15 level4 level19)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level16 level4 level20)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level17 level4 level21)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level18 level4 level22)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level19 level4 level23)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level20 level4 level24)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level21 level4 level25)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level22 level4 level26)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level23 level4 level27)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level24 level4 level28)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level25 level4 level29)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level26 level4 level30)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level27 level4 level31)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level28 level4 level32)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level29 level4 level33)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level30 level4 level34)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level31 level4 level35)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level32 level4 level36)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level33 level4 level37)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level34 level4 level38)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level35 level4 level39)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level36 level4 level40)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level37 level4 level41)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level38 level4 level42)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level39 level4 level43)
(sum level39 level7 level46)
(sum level39 level10 level49)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level40 level4 level44)
(sum level40 level7 level47)
(sum level40 level10 level50)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level41 level4 level45)
(sum level41 level7 level48)
(sum level41 level10 level51)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level42 level4 level46)
(sum level42 level7 level49)
(sum level42 level10 level52)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level43 level4 level47)
(sum level43 level7 level50)
(sum level43 level10 level53)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level44 level4 level48)
(sum level44 level7 level51)
(sum level44 level10 level54)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level45 level4 level49)
(sum level45 level7 level52)
(sum level45 level10 level55)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level46 level4 level50)
(sum level46 level7 level53)
(sum level46 level10 level56)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level47 level4 level51)
(sum level47 level7 level54)
(sum level47 level10 level57)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level48 level4 level52)
(sum level48 level7 level55)
(sum level48 level10 level58)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level49 level4 level53)
(sum level49 level7 level56)
(sum level49 level10 level59)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level50 level4 level54)
(sum level50 level7 level57)
(sum level50 level10 level60)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level51 level4 level55)
(sum level51 level7 level58)
(sum level51 level10 level61)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level52 level4 level56)
(sum level52 level7 level59)
(sum level52 level10 level62)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level53 level4 level57)
(sum level53 level7 level60)
(sum level53 level10 level63)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level54 level4 level58)
(sum level54 level7 level61)
(sum level54 level10 level64)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level55 level4 level59)
(sum level55 level7 level62)
(sum level55 level10 level65)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level56 level4 level60)
(sum level56 level7 level63)
(sum level56 level10 level66)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level57 level4 level61)
(sum level57 level7 level64)
(sum level57 level10 level67)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level58 level4 level62)
(sum level58 level7 level65)
(sum level58 level10 level68)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level59 level4 level63)
(sum level59 level7 level66)
(sum level59 level10 level69)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level60 level4 level64)
(sum level60 level7 level67)
(sum level60 level10 level70)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level61 level4 level65)
(sum level61 level7 level68)
(sum level61 level10 level71)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level62 level4 level66)
(sum level62 level7 level69)
(sum level62 level10 level72)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level63 level4 level67)
(sum level63 level7 level70)
(sum level63 level10 level73)
(sum level63 level16 level79)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level64 level4 level68)
(sum level64 level7 level71)
(sum level64 level10 level74)
(sum level64 level16 level80)
(sum level64 level17 level81)
(sum level64 level18 level82)
(sum level65 level4 level69)
(sum level65 level7 level72)
(sum level65 level10 level75)
(sum level65 level16 level81)
(sum level65 level17 level82)
(sum level65 level18 level83)
(sum level66 level4 level70)
(sum level66 level7 level73)
(sum level66 level10 level76)
(sum level66 level16 level82)
(sum level66 level17 level83)
(sum level66 level18 level84)
(sum level67 level4 level71)
(sum level67 level7 level74)
(sum level67 level10 level77)
(sum level67 level16 level83)
(sum level67 level17 level84)
(sum level67 level18 level85)
(sum level68 level4 level72)
(sum level68 level7 level75)
(sum level68 level10 level78)
(sum level68 level16 level84)
(sum level68 level17 level85)
(sum level68 level18 level86)
(sum level69 level4 level73)
(sum level69 level7 level76)
(sum level69 level10 level79)
(sum level69 level16 level85)
(sum level69 level17 level86)
(sum level69 level18 level87)
(sum level70 level4 level74)
(sum level70 level7 level77)
(sum level70 level10 level80)
(sum level70 level16 level86)
(sum level70 level17 level87)
(sum level70 level18 level88)
(sum level71 level4 level75)
(sum level71 level7 level78)
(sum level71 level10 level81)
(sum level71 level16 level87)
(sum level71 level17 level88)
(sum level71 level18 level89)
(sum level72 level4 level76)
(sum level72 level7 level79)
(sum level72 level10 level82)
(sum level72 level16 level88)
(sum level72 level17 level89)
(sum level72 level18 level90)
(sum level73 level4 level77)
(sum level73 level7 level80)
(sum level73 level10 level83)
(sum level73 level16 level89)
(sum level73 level17 level90)
(sum level73 level18 level91)
(sum level74 level4 level78)
(sum level74 level7 level81)
(sum level74 level10 level84)
(sum level74 level16 level90)
(sum level74 level17 level91)
(sum level74 level18 level92)
(sum level75 level4 level79)
(sum level75 level7 level82)
(sum level75 level10 level85)
(sum level75 level16 level91)
(sum level75 level17 level92)
(sum level75 level18 level93)
(sum level76 level4 level80)
(sum level76 level7 level83)
(sum level76 level10 level86)
(sum level76 level16 level92)
(sum level76 level17 level93)
(sum level76 level18 level94)
(sum level77 level4 level81)
(sum level77 level7 level84)
(sum level77 level10 level87)
(sum level77 level16 level93)
(sum level77 level17 level94)
(sum level77 level18 level95)
(sum level78 level4 level82)
(sum level78 level7 level85)
(sum level78 level10 level88)
(sum level78 level16 level94)
(sum level78 level17 level95)
(sum level78 level18 level96)
(sum level79 level4 level83)
(sum level79 level7 level86)
(sum level79 level10 level89)
(sum level79 level16 level95)
(sum level79 level17 level96)
(sum level79 level18 level97)
(sum level80 level4 level84)
(sum level80 level7 level87)
(sum level80 level10 level90)
(sum level80 level16 level96)
(sum level80 level17 level97)
(sum level80 level18 level98)
(sum level81 level4 level85)
(sum level81 level7 level88)
(sum level81 level10 level91)
(sum level81 level16 level97)
(sum level81 level17 level98)
(sum level81 level18 level99)
(sum level82 level4 level86)
(sum level82 level7 level89)
(sum level82 level10 level92)
(sum level82 level16 level98)
(sum level82 level17 level99)
(sum level82 level18 level100)
(sum level83 level4 level87)
(sum level83 level7 level90)
(sum level83 level10 level93)
(sum level83 level16 level99)
(sum level83 level17 level100)
(sum level84 level4 level88)
(sum level84 level7 level91)
(sum level84 level10 level94)
(sum level84 level16 level100)
(sum level85 level4 level89)
(sum level85 level7 level92)
(sum level85 level10 level95)
(sum level86 level4 level90)
(sum level86 level7 level93)
(sum level86 level10 level96)
(sum level87 level4 level91)
(sum level87 level7 level94)
(sum level87 level10 level97)
(sum level88 level4 level92)
(sum level88 level7 level95)
(sum level88 level10 level98)
(sum level89 level4 level93)
(sum level89 level7 level96)
(sum level89 level10 level99)
(sum level90 level4 level94)
(sum level90 level7 level97)
(sum level90 level10 level100)
(sum level91 level4 level95)
(sum level91 level7 level98)
(sum level92 level4 level96)
(sum level92 level7 level99)
(sum level93 level4 level97)
(sum level93 level7 level100)
(sum level94 level4 level98)
(sum level95 level4 level99)
(sum level96 level4 level100)

(connected l0 l1)
(fuelcost level7 l0 l1)
(connected l0 l2)
(fuelcost level17 l0 l2)
(connected l0 l3)
(fuelcost level4 l0 l3)
(connected l1 l0)
(fuelcost level7 l1 l0)
(connected l1 l2)
(fuelcost level10 l1 l2)
(connected l1 l3)
(fuelcost level16 l1 l3)
(connected l2 l0)
(fuelcost level17 l2 l0)
(connected l2 l1)
(fuelcost level10 l2 l1)
(connected l2 l3)
(fuelcost level18 l2 l3)
(connected l3 l0)
(fuelcost level4 l3 l0)
(connected l3 l1)
(fuelcost level16 l3 l1)
(connected l3 l2)
(fuelcost level18 l3 l2)

(at t0 l1)
(fuel t0 level100)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l1)
(at p3 l2)
(at p4 l3)
(at p5 l0)
(at p6 l1)
(at p7 l2)
(at p8 l0)
(at p9 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l3)
(at p2 l3)
(at p3 l0)
(at p4 l0)
(at p5 l2)
(at p6 l2)
(at p7 l3)
(at p8 l3)
(at p9 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 10
2. (drive t0 l1 l3 level84 level16 level100)
   deleted: (at t0 l1) (fuel t0 level100)
   added: (at t0 l3) (fuel t0 level84)
   goals met: 0 of 10
3. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 10
4. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 10
5. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 10
6. (drive t0 l3 l2 level66 level18 level84)
   deleted: (at t0 l3) (fuel t0 level84)
   added: (at t0 l2) (fuel t0 level66)
   goals met: 0 of 10
7. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 10
8. (drive t0 l2 l0 level49 level17 level66)
   deleted: (at t0 l2) (fuel t0 level66)
   added: (at t0 l0) (fuel t0 level49)
   goals met: 0 of 10
9. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 1 of 10
10. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 10
11. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 2 of 10
12. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 2 of 10
13. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 2 of 10
14. (drive t0 l0 l1 level42 level7 level49)
   deleted: (at t0 l0) (fuel t0 level49)
   added: (at t0 l1) (fuel t0 level42)
   goals met: 2 of 10
15. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 2 of 10
16. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 3 of 10
17. (drive t0 l1 l2 level32 level10 level42)
   deleted: (at t0 l1) (fuel t0 level42)
   added: (at t0 l2) (fuel t0 level32)
   goals met: 3 of 10
18. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 3 of 10
19. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 10
20. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 5 of 10
21. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 6 of 10
22. (drive t0 l2 l3 level14 level18 level32)
   deleted: (at t0 l2) (fuel t0 level32)
   added: (at t0 l3) (fuel t0 level14)
   goals met: 6 of 10
23. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 7 of 10
24. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 8 of 10
25. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 9 of 10
26. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 10 of 10
